CANCEL_COMMAND = "/cancel"

CANCEL_MESSAGE = "האבחון הופסק. נתראה בפעם הבאה."

WELCOME_MESSAGE = """
היי {user_full_name}! 
ברוך הבא למסע קטן פנימה, אל תוך עצמך.
נענה יחד על כמה שאלות שיעזרו לנו לזהות מהי אנרגיית הנשמה שלך — ומכאן להתחיל הבנה חדשה על עצמך.

אין תשובות נכונות או שגויות, ענה בכנות ובקלילות.
נצא לדרך? 🚀
"""

CONFIRMATION_START_BUTTON = "אני רוצה ומוכן/ה להתחיל"

FINISH_MESSAGE = """
שולח את הנתונים לעיבוד... \U0001f4ac
המתן בסבלנות (זה לא יקח יותר מידי) ☺️
"""

ERROR_MESSAGE = """
אירעה שגיאה בעיבוד הנתונים. נסה שנית מאוחר יותר. אם זה קורה שוב, נסה להתחיל מחדש.

{error}
"""


QUESTIONS = [
    (
        "כשאתה נכנס לחדר עם הרבה אנשים, מה הדבר הראשון שאתה שם לב אליו?",
        [
            "התחושות בחדר – האם האווירה מרגישה לי בטוחה או מאיימת",
            "מי נראה מוביל/משפיע ומה קורה בין האנשים",
            "מי נראה לי פתוח/לבבי להתחבר אליו",
            "מי מדבר עם מי ואיך אני מבין את הדינמיקה הכללית",
        ],
    ),
    (
        "כשמשהו משתבש בתכניות שלך – איך אתה מגיב?",
        [
            "מרגיש דחוי או חסר ערך",
            "מרגיש חוסר שליטה או עצבנות",
            "מרגיש שהעולם מסוכן / שצריך לסגת",
            "חושב איפה טעיתי ומה הייתי יכול לתכנן אחרת",
        ],
    ),
    (
        "איזה מהבאים מתאר בצורה הטובה ביותר את דפוס האנרגיה שלך?",
        [
            "אני יציב/ה ועקבי/ת — אני אוהב שגרה ולדעת למה לצפות",
            "אני סקרן/ית ומגוון/ת — אני זקוק לשינוי, תנועה וגיוון",
            "אני עוצמתי וממוקד — כשאני נכנס לתוך משהו, אני נכנס בכל הכוח עם אנרגיה מרוכזת",
        ],
    ),
    (
        "כשאת/ה מספר/ת על משהו – איך זה נשמע?",
        [
            "אני נוטה להתפזר, לקפוץ מנושא לנושא",
            "אני מדייק/ת, מתכנן/ת מראש",
            "מופנם יחסית אלא אם כן מרגיש/ה בטוח",
            "אני מתאר/ת בעיקר עובדות ומעשים",
        ],
    ),
    (
        "איזה מהמשפטים נשמע לך הכי קרוב לקול פנימי בתוכך כשמשהו לא טוב קורה?",
        [
            "אני לא מספיק מוכשר/ת",
            "אני לא אצליח / אכשל",
            "אני לא ראוי/ה לאהבה",
            "אני לא מוגן/ת / משהו רע יקרה",
            "אני לא בשליטה / מאבד/ת הנהגה",
        ],
    ),
        (
        "איזו סיטואציה הכי מעייפת אותך לאורך זמן?",
        [
            "כשיש יותר מדי שינויים, אני זקוק/ה ליציבות",
            "כשאין מספיק שינויים, אני צריך גיוון",
            "כשאין בעירה פנימית – אני מאבד/ת עניין",
        ],
    ),
    (
        "איך אתה מקבל החלטות חשובות?",
        [
            "לפי מה שנראה/נשמע לי שאוהב",
            "לפי היגיון ותכנון",
            "לפי תחושת בטן מיידית",
            "לפי מה שמרגיש לי מבחינה רגשית",
        ],
    ),
    (
        "מה הכי חשוב לך שירגישו ממך אנשים קרובים?",
        [
            "שאני רך ומקבל / אוהב",
            "שאני יציב ומוביל",
            "שאני חכם/ה ובעל ערך",
            "שאני רגיש/ה ומבין/ה אותם לעומק",
        ],
    ),
    ("אם היית יכול/ה לשנות משהו אחד בחיים שלך — מה זה היה?", None),
    ("השלם את המשפט: החיים הם...", None),
]
